GopalSaraf/Practicals/PSDL/include/proc/pic16c924.h
// Register: LCDSE
#define LCDSE LCDSE
extern volatile unsigned char           LCDSE               __at(0x10D);
#ifndef _LIB_BUILD
asm("LCDSE equ 010Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SE0                    :1;
        unsigned SE5                    :1;
        unsigned SE9                    :1;
        unsigned SE12                   :1;
        unsigned SE16                   :1;
        unsigned SE20                   :1;
        unsigned SE27                   :1;
        unsigned SE29                   :1;
    };
} LCDSEbits_t;
extern volatile LCDSEbits_t LCDSEbits __at(0x10D);
// bitfield macros
#define _LCDSE_SE0_POSN                                     0x0
#define _LCDSE_SE0_POSITION                                 0x0
#define _LCDSE_SE0_SIZE                                     0x1
#define _LCDSE_SE0_LENGTH                                   0x1
#define _LCDSE_SE0_MASK                                     0x1
#define _LCDSE_SE5_POSN                                     0x1
#define _LCDSE_SE5_POSITION                                 0x1
#define _LCDSE_SE5_SIZE                                     0x1
#define _LCDSE_SE5_LENGTH                                   0x1
#define _LCDSE_SE5_MASK                                     0x2
#define _LCDSE_SE9_POSN                                     0x2
#define _LCDSE_SE9_POSITION                                 0x2
#define _LCDSE_SE9_SIZE                                     0x1
#define _LCDSE_SE9_LENGTH                                   0x1
#define _LCDSE_SE9_MASK                                     0x4
#define _LCDSE_SE12_POSN                                    0x3
#define _LCDSE_SE12_POSITION                                0x3
#define _LCDSE_SE12_SIZE                                    0x1
#define _LCDSE_SE12_LENGTH                                  0x1
#define _LCDSE_SE12_MASK                                    0x8
#define _LCDSE_SE16_POSN                                    0x4
#define _LCDSE_SE16_POSITION                                0x4
#define _LCDSE_SE16_SIZE                                    0x1
#define _LCDSE_SE16_LENGTH                                  0x1
#define _LCDSE_SE16_MASK                                    0x10
#define _LCDSE_SE20_POSN                                    0x5
#define _LCDSE_SE20_POSITION                                0x5
#define _LCDSE_SE20_SIZE                                    0x1
#define _LCDSE_SE20_LENGTH                                  0x1
#define _LCDSE_SE20_MASK                                    0x20
#define _LCDSE_SE27_POSN                                    0x6
#define _LCDSE_SE27_POSITION                                0x6
#define _LCDSE_SE27_SIZE                                    0x1
#define _LCDSE_SE27_LENGTH                                  0x1
#define _LCDSE_SE27_MASK                                    0x40
#define _LCDSE_SE29_POSN                                    0x7
#define _LCDSE_SE29_POSITION                                0x7
#define _LCDSE_SE29_SIZE                                    0x1
#define _LCDSE_SE29_LENGTH                                  0x1
#define _LCDSE_SE29_MASK                                    0x80

// Register: LCDPS
#define LCDPS LCDPS
extern volatile unsigned char           LCDPS               __at(0x10E);
#ifndef _LIB_BUILD
asm("LCDPS equ 010Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LP                     :4;
    };
    struct {
        unsigned LP0                    :1;
        unsigned LP1                    :1;
        unsigned LP2                    :1;
        unsigned LP3                    :1;
    };
} LCDPSbits_t;
extern volatile LCDPSbits_t LCDPSbits __at(0x10E);
// bitfield macros
#define _LCDPS_LP_POSN                                      0x0
#define _LCDPS_LP_POSITION                                  0x0
#define _LCDPS_LP_SIZE                                      0x4
#define _LCDPS_LP_LENGTH                                    0x4
#define _LCDPS_LP_MASK                                      0xF
#define _LCDPS_LP0_POSN                                     0x0
#define _LCDPS_LP0_POSITION                                 0x0
#define _LCDPS_LP0_SIZE                                     0x1
#define _LCDPS_LP0_LENGTH                                   0x1
#define _LCDPS_LP0_MASK                                     0x1
#define _LCDPS_LP1_POSN                                     0x1
#define _LCDPS_LP1_POSITION                                 0x1
#define _LCDPS_LP1_SIZE                                     0x1
#define _LCDPS_LP1_LENGTH                                   0x1
#define _LCDPS_LP1_MASK                                     0x2
#define _LCDPS_LP2_POSN                                     0x2
#define _LCDPS_LP2_POSITION                                 0x2
#define _LCDPS_LP2_SIZE                                     0x1
#define _LCDPS_LP2_LENGTH                                   0x1
#define _LCDPS_LP2_MASK                                     0x4
#define _LCDPS_LP3_POSN                                     0x3
#define _LCDPS_LP3_POSITION                                 0x3
#define _LCDPS_LP3_SIZE                                     0x1
#define _LCDPS_LP3_LENGTH                                   0x1
#define _LCDPS_LP3_MASK                                     0x8

// Register: LCDCON
#define LCDCON LCDCON
extern volatile unsigned char           LCDCON              __at(0x10F);
#ifndef _LIB_BUILD
asm("LCDCON equ 010Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LMUX                   :2;
        unsigned CS                     :2;
        unsigned VGEN                   :1;
        unsigned                        :1;
        unsigned SLPEN                  :1;
        unsigned LCDEN                  :1;
    };
    struct {
        unsigned LMUX0                  :1;
        unsigned LMUX1                  :1;
        unsigned CS0                    :1;
        unsigned CS1                    :1;
    };
} LCDCONbits_t;
extern volatile LCDCONbits_t LCDCONbits __at(0x10F);
// bitfield macros
#define _LCDCON_LMUX_POSN                                   0x0
#define _LCDCON_LMUX_POSITION                               0x0
#define _LCDCON_LMUX_SIZE                                   0x2
#define _LCDCON_LMUX_LENGTH                                 0x2
#define _LCDCON_LMUX_MASK                                   0x3
#define _LCDCON_CS_POSN                                     0x2
#define _LCDCON_CS_POSITION                                 0x2
#define _LCDCON_CS_SIZE                                     0x2
#define _LCDCON_CS_LENGTH                                   0x2
#define _LCDCON_CS_MASK                                     0xC
#define _LCDCON_VGEN_POSN                                   0x4
#define _LCDCON_VGEN_POSITION                               0x4
#define _LCDCON_VGEN_SIZE                                   0x1
#define _LCDCON_VGEN_LENGTH                                 0x1
#define _LCDCON_VGEN_MASK                                   0x10
#define _LCDCON_SLPEN_POSN                                  0x6
#define _LCDCON_SLPEN_POSITION                              0x6
#define _LCDCON_SLPEN_SIZE                                  0x1
#define _LCDCON_SLPEN_LENGTH                                0x1
#define _LCDCON_SLPEN_MASK                                  0x40
#define _LCDCON_LCDEN_POSN                                  0x7
#define _LCDCON_LCDEN_POSITION                              0x7
#define _LCDCON_LCDEN_SIZE                                  0x1
#define _LCDCON_LCDEN_LENGTH                                0x1
#define _LCDCON_LCDEN_MASK                                  0x80
#define _LCDCON_LMUX0_POSN                                  0x0
#define _LCDCON_LMUX0_POSITION                              0x0
#define _LCDCON_LMUX0_SIZE                                  0x1
#define _LCDCON_LMUX0_LENGTH                                0x1
#define _LCDCON_LMUX0_MASK                                  0x1
#define _LCDCON_LMUX1_POSN                                  0x1
#define _LCDCON_LMUX1_POSITION                              0x1
#define _LCDCON_LMUX1_SIZE                                  0x1
#define _LCDCON_LMUX1_LENGTH                                0x1
#define _LCDCON_LMUX1_MASK                                  0x2
#define _LCDCON_CS0_POSN                                    0x2
#define _LCDCON_CS0_POSITION                                0x2
#define _LCDCON_CS0_SIZE                                    0x1
#define _LCDCON_CS0_LENGTH                                  0x1
#define _LCDCON_CS0_MASK                                    0x4
#define _LCDCON_CS1_POSN                                    0x3
#define _LCDCON_CS1_POSITION                                0x3
#define _LCDCON_CS1_SIZE                                    0x1
#define _LCDCON_CS1_LENGTH                                  0x1
#define _LCDCON_CS1_MASK                                    0x8

// Register: LCDD00
#define LCDD00 LCDD00
extern volatile unsigned char           LCDD00              __at(0x110);
#ifndef _LIB_BUILD
asm("LCDD00 equ 0110h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG00                  :1;
        unsigned SEG01                  :1;
        unsigned SEG02                  :1;
        unsigned SEG03                  :1;
        unsigned SEG04                  :1;
        unsigned SEG05                  :1;
        unsigned SEG06                  :1;
        unsigned SEG07                  :1;
    };
} LCDD00bits_t;
extern volatile LCDD00bits_t LCDD00bits __at(0x110);
// bitfield macros
#define _LCDD00_SEG00_POSN                                  0x0
#define _LCDD00_SEG00_POSITION                              0x0
#define _LCDD00_SEG00_SIZE                                  0x1
#define _LCDD00_SEG00_LENGTH                                0x1
#define _LCDD00_SEG00_MASK                                  0x1
#define _LCDD00_SEG01_POSN                                  0x1
#define _LCDD00_SEG01_POSITION                              0x1
#define _LCDD00_SEG01_SIZE                                  0x1
#define _LCDD00_SEG01_LENGTH                                0x1
#define _LCDD00_SEG01_MASK                                  0x2
#define _LCDD00_SEG02_POSN                                  0x2
#define _LCDD00_SEG02_POSITION                              0x2
#define _LCDD00_SEG02_SIZE                                  0x1
#define _LCDD00_SEG02_LENGTH                                0x1
#define _LCDD00_SEG02_MASK                                  0x4
#define _LCDD00_SEG03_POSN                                  0x3
#define _LCDD00_SEG03_POSITION                              0x3
#define _LCDD00_SEG03_SIZE                                  0x1
#define _LCDD00_SEG03_LENGTH                                0x1
#define _LCDD00_SEG03_MASK                                  0x8
#define _LCDD00_SEG04_POSN                                  0x4
#define _LCDD00_SEG04_POSITION                              0x4
#define _LCDD00_SEG04_SIZE                                  0x1
#define _LCDD00_SEG04_LENGTH                                0x1
#define _LCDD00_SEG04_MASK                                  0x10
#define _LCDD00_SEG05_POSN                                  0x5
#define _LCDD00_SEG05_POSITION                              0x5
#define _LCDD00_SEG05_SIZE                                  0x1
#define _LCDD00_SEG05_LENGTH                                0x1
#define _LCDD00_SEG05_MASK                                  0x20
#define _LCDD00_SEG06_POSN                                  0x6
#define _LCDD00_SEG06_POSITION                              0x6
#define _LCDD00_SEG06_SIZE                                  0x1
#define _LCDD00_SEG06_LENGTH                                0x1
#define _LCDD00_SEG06_MASK                                  0x40
#define _LCDD00_SEG07_POSN                                  0x7
#define _LCDD00_SEG07_POSITION                              0x7
#define _LCDD00_SEG07_SIZE                                  0x1
#define _LCDD00_SEG07_LENGTH                                0x1
#define _LCDD00_SEG07_MASK                                  0x80

// Register: LCDD01
#define LCDD01 LCDD01
extern volatile unsigned char           LCDD01              __at(0x111);
#ifndef _LIB_BUILD
asm("LCDD01 equ 0111h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG08                  :1;
        unsigned SEG09                  :1;
        unsigned SEG10                  :1;
        unsigned SEG11                  :1;
        unsigned SEG12                  :1;
        unsigned SEG13                  :1;
        unsigned SEG14                  :1;
        unsigned SEG15                  :1;
    };
} LCDD01bits_t;
extern volatile LCDD01bits_t LCDD01bits __at(0x111);
// bitfield macros
#define _LCDD01_SEG08_POSN                                  0x0
#define _LCDD01_SEG08_POSITION                              0x0
#define _LCDD01_SEG08_SIZE                                  0x1
#define _LCDD01_SEG08_LENGTH                                0x1
#define _LCDD01_SEG08_MASK                                  0x1
#define _LCDD01_SEG09_POSN                                  0x1
#define _LCDD01_SEG09_POSITION                              0x1
#define _LCDD01_SEG09_SIZE                                  0x1
#define _LCDD01_SEG09_LENGTH                                0x1
#define _LCDD01_SEG09_MASK                                  0x2
#define _LCDD01_SEG10_POSN                                  0x2
#define _LCDD01_SEG10_POSITION                              0x2
#define _LCDD01_SEG10_SIZE                                  0x1
#define _LCDD01_SEG10_LENGTH                                0x1
#define _LCDD01_SEG10_MASK                                  0x4
#define _LCDD01_SEG11_POSN                                  0x3
#define _LCDD01_SEG11_POSITION                              0x3
#define _LCDD01_SEG11_SIZE                                  0x1
#define _LCDD01_SEG11_LENGTH                                0x1
#define _LCDD01_SEG11_MASK                                  0x8
#define _LCDD01_SEG12_POSN                                  0x4
#define _LCDD01_SEG12_POSITION                              0x4
#define _LCDD01_SEG12_SIZE                                  0x1
#define _LCDD01_SEG12_LENGTH                                0x1
#define _LCDD01_SEG12_MASK                                  0x10
#define _LCDD01_SEG13_POSN                                  0x5
#define _LCDD01_SEG13_POSITION                              0x5
#define _LCDD01_SEG13_SIZE                                  0x1
#define _LCDD01_SEG13_LENGTH                                0x1
#define _LCDD01_SEG13_MASK                                  0x20
#define _LCDD01_SEG14_POSN                                  0x6
#define _LCDD01_SEG14_POSITION                              0x6
#define _LCDD01_SEG14_SIZE                                  0x1
#define _LCDD01_SEG14_LENGTH                                0x1
#define _LCDD01_SEG14_MASK                                  0x40
#define _LCDD01_SEG15_POSN                                  0x7
#define _LCDD01_SEG15_POSITION                              0x7
#define _LCDD01_SEG15_SIZE                                  0x1
#define _LCDD01_SEG15_LENGTH                                0x1
#define _LCDD01_SEG15_MASK                                  0x80

// Register: LCDD02
#define LCDD02 LCDD02
extern volatile unsigned char           LCDD02              __at(0x112);
#ifndef _LIB_BUILD
asm("LCDD02 equ 0112h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG16                  :1;
        unsigned SEG17                  :1;
        unsigned SEG18                  :1;
        unsigned SEG19                  :1;
        unsigned SEG20                  :1;
        unsigned SEG21                  :1;
        unsigned SEG22                  :1;
        unsigned SEG23                  :1;
    };
} LCDD02bits_t;
extern volatile LCDD02bits_t LCDD02bits __at(0x112);
// bitfield macros
#define _LCDD02_SEG16_POSN                                  0x0
#define _LCDD02_SEG16_POSITION                              0x0
#define _LCDD02_SEG16_SIZE                                  0x1
#define _LCDD02_SEG16_LENGTH                                0x1
#define _LCDD02_SEG16_MASK                                  0x1
#define _LCDD02_SEG17_POSN                                  0x1
#define _LCDD02_SEG17_POSITION                              0x1
#define _LCDD02_SEG17_SIZE                                  0x1
#define _LCDD02_SEG17_LENGTH                                0x1
#define _LCDD02_SEG17_MASK                                  0x2
#define _LCDD02_SEG18_POSN                                  0x2
#define _LCDD02_SEG18_POSITION                              0x2
#define _LCDD02_SEG18_SIZE                                  0x1
#define _LCDD02_SEG18_LENGTH                                0x1
#define _LCDD02_SEG18_MASK                                  0x4
#define _LCDD02_SEG19_POSN                                  0x3
#define _LCDD02_SEG19_POSITION                              0x3
#define _LCDD02_SEG19_SIZE                                  0x1
#define _LCDD02_SEG19_LENGTH                                0x1
#define _LCDD02_SEG19_MASK                                  0x8
#define _LCDD02_SEG20_POSN                                  0x4
#define _LCDD02_SEG20_POSITION                              0x4
#define _LCDD02_SEG20_SIZE                                  0x1
#define _LCDD02_SEG20_LENGTH                                0x1
#define _LCDD02_SEG20_MASK                                  0x10
#define _LCDD02_SEG21_POSN                                  0x5
#define _LCDD02_SEG21_POSITION                              0x5
#define _LCDD02_SEG21_SIZE                                  0x1
#define _LCDD02_SEG21_LENGTH                                0x1
#define _LCDD02_SEG21_MASK                                  0x20
#define _LCDD02_SEG22_POSN                                  0x6
#define _LCDD02_SEG22_POSITION                              0x6
#define _LCDD02_SEG22_SIZE                                  0x1
#define _LCDD02_SEG22_LENGTH                                0x1
#define _LCDD02_SEG22_MASK                                  0x40
#define _LCDD02_SEG23_POSN                                  0x7
#define _LCDD02_SEG23_POSITION                              0x7
#define _LCDD02_SEG23_SIZE                                  0x1
#define _LCDD02_SEG23_LENGTH                                0x1
#define _LCDD02_SEG23_MASK                                  0x80

// Register: LCDD03
#define LCDD03 LCDD03
extern volatile unsigned char           LCDD03              __at(0x113);
#ifndef _LIB_BUILD
asm("LCDD03 equ 0113h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG24                  :1;
        unsigned SEG25                  :1;
        unsigned SEG26                  :1;
        unsigned SEG27                  :1;
        unsigned SEG28                  :1;
        unsigned SEG29                  :1;
        unsigned SEG30                  :1;
        unsigned SEG31                  :1;
    };
} LCDD03bits_t;
extern volatile LCDD03bits_t LCDD03bits __at(0x113);
// bitfield macros
#define _LCDD03_SEG24_POSN                                  0x0
#define _LCDD03_SEG24_POSITION                              0x0
#define _LCDD03_SEG24_SIZE                                  0x1
#define _LCDD03_SEG24_LENGTH                                0x1
#define _LCDD03_SEG24_MASK                                  0x1
#define _LCDD03_SEG25_POSN                                  0x1
#define _LCDD03_SEG25_POSITION                              0x1
#define _LCDD03_SEG25_SIZE                                  0x1
#define _LCDD03_SEG25_LENGTH                                0x1
#define _LCDD03_SEG25_MASK                                  0x2
#define _LCDD03_SEG26_POSN                                  0x2
#define _LCDD03_SEG26_POSITION                              0x2
#define _LCDD03_SEG26_SIZE                                  0x1
#define _LCDD03_SEG26_LENGTH                                0x1
#define _LCDD03_SEG26_MASK                                  0x4
#define _LCDD03_SEG27_POSN                                  0x3
#define _LCDD03_SEG27_POSITION                              0x3
#define _LCDD03_SEG27_SIZE                                  0x1
#define _LCDD03_SEG27_LENGTH                                0x1
#define _LCDD03_SEG27_MASK                                  0x8
#define _LCDD03_SEG28_POSN                                  0x4
#define _LCDD03_SEG28_POSITION                              0x4
#define _LCDD03_SEG28_SIZE                                  0x1
#define _LCDD03_SEG28_LENGTH                                0x1
#define _LCDD03_SEG28_MASK                                  0x10
#define _LCDD03_SEG29_POSN                                  0x5
#define _LCDD03_SEG29_POSITION                              0x5
#define _LCDD03_SEG29_SIZE                                  0x1
#define _LCDD03_SEG29_LENGTH                                0x1
#define _LCDD03_SEG29_MASK                                  0x20
#define _LCDD03_SEG30_POSN                                  0x6
#define _LCDD03_SEG30_POSITION                              0x6
#define _LCDD03_SEG30_SIZE                                  0x1
#define _LCDD03_SEG30_LENGTH                                0x1
#define _LCDD03_SEG30_MASK                                  0x40
#define _LCDD03_SEG31_POSN                                  0x7
#define _LCDD03_SEG31_POSITION                              0x7
#define _LCDD03_SEG31_SIZE                                  0x1
#define _LCDD03_SEG31_LENGTH                                0x1
#define _LCDD03_SEG31_MASK                                  0x80

// Register: LCDD04
#define LCDD04 LCDD04
extern volatile unsigned char           LCDD04              __at(0x114);
#ifndef _LIB_BUILD
asm("LCDD04 equ 0114h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG00                  :1;
        unsigned SEG01                  :1;
        unsigned SEG02                  :1;
        unsigned SEG03                  :1;
        unsigned SEG04                  :1;
        unsigned SEG05                  :1;
        unsigned SEG06                  :1;
        unsigned SEG07                  :1;
    };
} LCDD04bits_t;
